inletTest6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottomEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          41981;
        startFace       83424;
    }
    topEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          41981;
        startFace       125405;
    }
    inlet
    {
        type            patch;
        nFaces          159;
        startFace       167386;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       167545;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1732;
        startFace       167605;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          51;
        startFace       169337;
    }
    symmetryLine
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          318;
        startFace       169388;
    }
)

// ************************************************************************* //
